[
    {
        "name": "ONIMAI: I'm Now Your Sister!",
        "id":"onimai",

        "description": "Recluse Mahiro would rather lose himself in his video games than venture into the outside world. After emerging from his cocoon of a room, he’s shocked to see a teenage girl staring back at him in the mirror. What did his younger sister Mihari do to him? Mahiro should be angry, yet he’s curious about this second chance at life. Can he soar in this brave new world? He’s intrigued to find out!",
        "notes": "Ripped from Crunchyroll. As such, censorship and translation errors may be present.",
        "icon": "onimai.webp",
        "poster": "onimaiposter.webp",

        "seasons": [
            {
                "name": "ONIMAI: I'm Now Your Sister!",
                "parent": "onimai",
                "id": "onimai.s1",

                "episodes": [
                    {
                        "name": "Mahiro's Confusing New Body",
                        "parent": "onimai.s1",
                        "id": "onimai.s1.e1",

                        "description": "We follow Mahiro Oyama, an unemployed good-for-nothing shut-in, who not only hasn't left the house in two years, but is also exceedingly addicted to gross video games. One afternoon, he wakes up and notices that his body feels a little off. Finding that strange, he goes to reach for his tablet, but what does he see in his reflection, but an adorable young lady. I wonder what lies in store for the \"former\" big brother, Mahiro as he's thrust headfirst into his new life as a girl.",
                        "thumbnail": "on_ep1_thmb.jpeg",
                        "length": 1420,

                        "formats": {
                            "main": {
                                "best": "onimai.s1.e1.main.best.mp4",
                                "good": "onimai.s1.e1.main.good.mp4",
                                "okay": "onimai.s1.e1.main.okay.mp4"
                            },
                            "hardsub": {
                                "best": "onimai.s1.e1.hardsub.best.mp4",
                                "good": "onimai.s1.e1.hardsub.good.mp4",
                                "okay": "onimai.s1.e1.hardsub.okay.mp4"
                            }
                        },

                        "intro": [ 310, 400 ],
                        "outro": [ 1325 ]
                    }
                ]
            }
        ]
    },
    {
        "name": "BOCCHI THE ROCK!",
        "id":"bocchi",

        "description": "Short description from IMDb (Crunchyroll's is WAY too long): Hitori \"Bocchi-chan\" Goto is a lonely high school girl whose heart lies in her guitar; she meets Nijika Ijichi and joins \"Kessoku Band.\"",
        "notes": "Ripped from Crunchyroll. As such, censorship and translation errors may be present.",
        "icon": "bocchi_ic.webp",
        "poster": "bcposter",

        "seasons": []
    },
    {
        "name": "DON'T TOY WITH ME, MISS NAGATORO",
        "id":"nagatoro",

        "description": "\"A girl in a lower grade just made me cry!\"\nOne day, Senpai visits the library after school and becomes the target of a super sadistic junior!  The name of the girl who teases, torments, and tantalizes Senpai is \"Nagatoro!\"  She's annoying yet adorable. It's painful, but you still want to be by her side. This is a story about an extremely sadistic and temperamental girl and you'll feel something awaken inside of you.",
        "notes": "Ripped from Crunchyroll. As such, censorship and translation errors may be present.",
        "icon": "nagatoroic.png",
        "poster": "ngposter",

        "seasons": []
    },
    {
        "name": "Lucky Star",
        "id":"luckystar",

        "description": "What’s the best way to eat dessert? Do twins really have a psychic connection? What kind of guys are into moe girls? These are the kinds of questions that float through the inquisitive mind of anime super-fan Konata Izumi. When she’s not lost in her favorite manga or logging hours in one of her online games, she’s debating the mysteries of the universe with the best friends a girl could ask for.",
        "notes": "Ripped from Crunchyroll. As such, censorship and translation errors may be present.",
        "icon": "luckystaric.png",
        "poster": "lsposter",

        "seasons": []
    }
]